susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H747.h
#define DFSDM1_CKIN5_PB7_ PB7,GPIO_AF11
#define DFSDM1_CKIN5_PC10_ PC10,GPIO_AF3
#define DFSDM1_CKIN5_PE13_ PE13,GPIO_AF3
#define _DFSDM1_CKIN5_PB7_ 1
#define _DFSDM1_CKIN5_PC10_ 1
#define _DFSDM1_CKIN5_PE13_ 1

#define DFSDM1_CKIN6_PD0_ PD0,GPIO_AF3
#define DFSDM1_CKIN6_PF14_ PF14,GPIO_AF3
#define _DFSDM1_CKIN6_PD0_ 1
#define _DFSDM1_CKIN6_PF14_ 1

#define DFSDM1_CKIN7_PB11_ PB11,GPIO_AF6
#define DFSDM1_CKIN7_PB8_ PB8,GPIO_AF3
#define _DFSDM1_CKIN7_PB11_ 1
#define _DFSDM1_CKIN7_PB8_ 1

#define DFSDM1_CKOUT_PB0_ PB0,GPIO_AF6
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PC2_C_ PC2_C,GPIO_AF6
#define DFSDM1_CKOUT_PD10_ PD10,GPIO_AF3
#define DFSDM1_CKOUT_PD3_ PD3,GPIO_AF3
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF3
#define _DFSDM1_CKOUT_PB0_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PC2_C_ 1
#define _DFSDM1_CKOUT_PD10_ 1
#define _DFSDM1_CKOUT_PD3_ 1
#define _DFSDM1_CKOUT_PE9_ 1

#define DFSDM1_DATIN0_PC1_ PC1,GPIO_AF3
#define _DFSDM1_DATIN0_PC1_ 1

#define DFSDM1_DATIN1_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PC3_ PC3,GPIO_AF3
#define DFSDM1_DATIN1_PC3_C_ PC3_C,GPIO_AF3
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF4
#define _DFSDM1_DATIN1_PB1_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PC3_ 1
#define _DFSDM1_DATIN1_PC3_C_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PC5_ PC5,GPIO_AF3
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF3
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PC5_ 1
#define _DFSDM1_DATIN2_PE7_ 1

#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF4
#define DFSDM1_DATIN3_PD9_ PD9,GPIO_AF3
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF3
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PD9_ 1
#define _DFSDM1_DATIN3_PE4_ 1

#define DFSDM1_DATIN4_PC0_ PC0,GPIO_AF6
#define DFSDM1_DATIN4_PD7_ PD7,GPIO_AF3
#define DFSDM1_DATIN4_PE10_ PE10,GPIO_AF3
#define _DFSDM1_DATIN4_PC0_ 1
#define _DFSDM1_DATIN4_PD7_ 1
#define _DFSDM1_DATIN4_PE10_ 1

#define DFSDM1_DATIN5_PB6_ PB6,GPIO_AF11
#define DFSDM1_DATIN5_PC11_ PC11,GPIO_AF3
#define DFSDM1_DATIN5_PE12_ PE12,GPIO_AF3
#define _DFSDM1_DATIN5_PB6_ 1
#define _DFSDM1_DATIN5_PC11_ 1
#define _DFSDM1_DATIN5_PE12_ 1

#define DFSDM1_DATIN6_PD1_ PD1,GPIO_AF3
#define DFSDM1_DATIN6_PF13_ PF13,GPIO_AF3
#define _DFSDM1_DATIN6_PD1_ 1
#define _DFSDM1_DATIN6_PF13_ 1

#define DFSDM1_DATIN7_PB10_ PB10,GPIO_AF6
#define DFSDM1_DATIN7_PB9_ PB9,GPIO_AF3
#define _DFSDM1_DATIN7_PB10_ 1
#define _DFSDM1_DATIN7_PB9_ 1

#define DSIHOST_TE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF13
#define DSIHOST_TE_PB11_ PB11,GPIO_AF13
#define DSIHOST_TE_PJ2_ PJ2,GPIO_AF13
#define _DSIHOST_TE_PA15 (JTDI)_ 1
#define _DSIHOST_TE_PB11_ 1
#define _DSIHOST_TE_PJ2_ 1

#define ETH_COL_PA3_ PA3,GPIO_AF11
#define ETH_COL_PH3_ PH3,GPIO_AF11
#define _ETH_COL_PA3_ 1
#define _ETH_COL_PH3_ 1

#define ETH_CRS_PA0_ PA0,GPIO_AF11
#define ETH_CRS_PA0_C_ PA0_C,GPIO_AF11
#define ETH_CRS_PH2_ PH2,GPIO_AF11
#define _ETH_CRS_PA0_ 1
#define _ETH_CRS_PA0_C_ 1
#define _ETH_CRS_PH2_ 1

#define ETH_CRS_DV_PA7_ PA7,GPIO_AF11
#define _ETH_CRS_DV_PA7_ 1

#define ETH_MDC_PC1_ PC1,GPIO_AF11
#define _ETH_MDC_PC1_ 1

#define ETH_MDIO_PA2_ PA2,GPIO_AF11
#define _ETH_MDIO_PA2_ 1

#define ETH_PPS_OUT_PB5_ PB5,GPIO_AF11
#define ETH_PPS_OUT_PG8_ PG8,GPIO_AF11
#define _ETH_PPS_OUT_PB5_ 1
#define _ETH_PPS_OUT_PG8_ 1

#define ETH_REF_CLK_PA1_ PA1,GPIO_AF11
#define ETH_REF_CLK_PA1_C_ PA1_C,GPIO_AF11
#define _ETH_REF_CLK_PA1_ 1
#define _ETH_REF_CLK_PA1_C_ 1

#define ETH_RXD0_PC4_ PC4,GPIO_AF11
#define _ETH_RXD0_PC4_ 1

#define ETH_RXD1_PC5_ PC5,GPIO_AF11
#define _ETH_RXD1_PC5_ 1

#define ETH_RXD2_PB0_ PB0,GPIO_AF11
#define ETH_RXD2_PH6_ PH6,GPIO_AF11
#define _ETH_RXD2_PB0_ 1
#define _ETH_RXD2_PH6_ 1

#define ETH_RXD3_PB1_ PB1,GPIO_AF11
#define ETH_RXD3_PH7_ PH7,GPIO_AF11
#define _ETH_RXD3_PB1_ 1
#define _ETH_RXD3_PH7_ 1

#define ETH_RX_CLK_PA1_ PA1,GPIO_AF11
#define ETH_RX_CLK_PA1_C_ PA1_C,GPIO_AF11
#define _ETH_RX_CLK_PA1_ 1
#define _ETH_RX_CLK_PA1_C_ 1

#define ETH_RX_DV_PA7_ PA7,GPIO_AF11
#define _ETH_RX_DV_PA7_ 1

#define ETH_RX_ER_PB10_ PB10,GPIO_AF11
#define ETH_RX_ER_PI10_ PI10,GPIO_AF11
#define _ETH_RX_ER_PB10_ 1
#define _ETH_RX_ER_PI10_ 1

#define ETH_TXD0_PB12_ PB12,GPIO_AF11
#define ETH_TXD0_PG13_ PG13,GPIO_AF11
#define _ETH_TXD0_PB12_ 1
#define _ETH_TXD0_PG13_ 1

#define ETH_TXD1_PB13_ PB13,GPIO_AF11
#define ETH_TXD1_PG12_ PG12,GPIO_AF11
#define ETH_TXD1_PG14_ PG14,GPIO_AF11
#define _ETH_TXD1_PB13_ 1
#define _ETH_TXD1_PG12_ 1
#define _ETH_TXD1_PG14_ 1

#define ETH_TXD2_PC2_ PC2,GPIO_AF11
#define ETH_TXD2_PC2_C_ PC2_C,GPIO_AF11
#define _ETH_TXD2_PC2_ 1
#define _ETH_TXD2_PC2_C_ 1

#define ETH_TXD3_PB8_ PB8,GPIO_AF11
#define ETH_TXD3_PE2_ PE2,GPIO_AF11
#define _ETH_TXD3_PB8_ 1
#define _ETH_TXD3_PE2_ 1

#define ETH_TX_CLK_PC3_ PC3,GPIO_AF11
#define ETH_TX_CLK_PC3_C_ PC3_C,GPIO_AF11
#define _ETH_TX_CLK_PC3_ 1
#define _ETH_TX_CLK_PC3_C_ 1

#define ETH_TX_EN_PB11_ PB11,GPIO_AF11
#define ETH_TX_EN_PG11_ PG11,GPIO_AF11
#define _ETH_TX_EN_PB11_ 1
#define _ETH_TX_EN_PG11_ 1

#define FDCAN1_RX_PA11_ PA11,GPIO_AF9
#define FDCAN1_RX_PB8_ PB8,GPIO_AF9
#define FDCAN1_RX_PD0_ PD0,GPIO_AF9
#define FDCAN1_RX_PH14_ PH14,GPIO_AF9
#define FDCAN1_RX_PI9_ PI9,GPIO_AF9
#define _FDCAN1_RX_PA11_ 1
#define _FDCAN1_RX_PB8_ 1
#define _FDCAN1_RX_PD0_ 1
#define _FDCAN1_RX_PH14_ 1
#define _FDCAN1_RX_PI9_ 1

#define FDCAN1_TX_PA12_ PA12,GPIO_AF9
#define FDCAN1_TX_PB9_ PB9,GPIO_AF9
#define FDCAN1_TX_PD1_ PD1,GPIO_AF9
#define FDCAN1_TX_PH13_ PH13,GPIO_AF9
#define _FDCAN1_TX_PA12_ 1
#define _FDCAN1_TX_PB9_ 1
#define _FDCAN1_TX_PD1_ 1
#define _FDCAN1_TX_PH13_ 1

#define FDCAN2_RX_PB12_ PB12,GPIO_AF9
#define FDCAN2_RX_PB5_ PB5,GPIO_AF9
#define _FDCAN2_RX_PB12_ 1
#define _FDCAN2_RX_PB5_ 1

#define FDCAN2_TX_PB13_ PB13,GPIO_AF9
#define FDCAN2_TX_PB6_ PB6,GPIO_AF9
#define _FDCAN2_TX_PB13_ 1
#define _FDCAN2_TX_PB6_ 1

#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

