susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H747.h
#define HRTIM_CHA1_PC6_ PC6,GPIO_AF1
#define _HRTIM_CHA1_PC6_ 1

#define HRTIM_CHA2_PC7_ PC7,GPIO_AF1
#define _HRTIM_CHA2_PC7_ 1

#define HRTIM_CHB1_PC8_ PC8,GPIO_AF1
#define _HRTIM_CHB1_PC8_ 1

#define HRTIM_CHB2_PA8_ PA8,GPIO_AF2
#define _HRTIM_CHB2_PA8_ 1

#define HRTIM_CHC1_PA9_ PA9,GPIO_AF2
#define _HRTIM_CHC1_PA9_ 1

#define HRTIM_CHC2_PA10_ PA10,GPIO_AF2
#define _HRTIM_CHC2_PA10_ 1

#define HRTIM_CHD1_PA11_ PA11,GPIO_AF2
#define _HRTIM_CHD1_PA11_ 1

#define HRTIM_CHD2_PA12_ PA12,GPIO_AF2
#define _HRTIM_CHD2_PA12_ 1

#define HRTIM_CHE1_PG6_ PG6,GPIO_AF2
#define _HRTIM_CHE1_PG6_ 1

#define HRTIM_CHE2_PG7_ PG7,GPIO_AF2
#define _HRTIM_CHE2_PG7_ 1

#define HRTIM_EEV1_PC10_ PC10,GPIO_AF2
#define _HRTIM_EEV1_PC10_ 1

#define HRTIM_EEV10_PG13_ PG13,GPIO_AF2
#define _HRTIM_EEV10_PG13_ 1

#define HRTIM_EEV2_PC12_ PC12,GPIO_AF2
#define _HRTIM_EEV2_PC12_ 1

#define HRTIM_EEV3_PD5_ PD5,GPIO_AF2
#define _HRTIM_EEV3_PD5_ 1

#define HRTIM_EEV4_PG11_ PG11,GPIO_AF2
#define _HRTIM_EEV4_PG11_ 1

#define HRTIM_EEV5_PG12_ PG12,GPIO_AF2
#define _HRTIM_EEV5_PG12_ 1

#define HRTIM_EEV6_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF3
#define _HRTIM_EEV6_PB4 (NJTRST)_ 1

#define HRTIM_EEV7_PB5_ PB5,GPIO_AF3
#define _HRTIM_EEV7_PB5_ 1

#define HRTIM_EEV8_PB6_ PB6,GPIO_AF3
#define _HRTIM_EEV8_PB6_ 1

#define HRTIM_EEV9_PB7_ PB7,GPIO_AF3
#define _HRTIM_EEV9_PB7_ 1

#define HRTIM_FLT1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF2
#define _HRTIM_FLT1_PA15 (JTDI)_ 1

#define HRTIM_FLT2_PC11_ PC11,GPIO_AF2
#define _HRTIM_FLT2_PC11_ 1

#define HRTIM_FLT3_PD4_ PD4,GPIO_AF2
#define _HRTIM_FLT3_PD4_ 1

#define HRTIM_FLT4_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF2
#define _HRTIM_FLT4_PB3 (JTDO/TRACESWO)_ 1

#define HRTIM_FLT5_PG10_ PG10,GPIO_AF2
#define _HRTIM_FLT5_PG10_ 1

#define HRTIM_SCIN_PB11_ PB11,GPIO_AF2
#define HRTIM_SCIN_PE0_ PE0,GPIO_AF3
#define _HRTIM_SCIN_PB11_ 1
#define _HRTIM_SCIN_PE0_ 1

#define HRTIM_SCOUT_PB10_ PB10,GPIO_AF2
#define HRTIM_SCOUT_PE1_ PE1,GPIO_AF3
#define _HRTIM_SCOUT_PB10_ 1
#define _HRTIM_SCOUT_PE1_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2C4_SCL_PB6_ PB6,GPIO_AF6
#define I2C4_SCL_PB8_ PB8,GPIO_AF6
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define I2C4_SCL_PH11_ PH11,GPIO_AF4
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PB8_ 1
#define _I2C4_SCL_PD12_ 1
#define _I2C4_SCL_PF14_ 1
#define _I2C4_SCL_PH11_ 1

#define I2C4_SDA_PB7_ PB7,GPIO_AF6
#define I2C4_SDA_PB9_ PB9,GPIO_AF6
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define I2C4_SDA_PH12_ PH12,GPIO_AF4
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PB9_ 1
#define _I2C4_SDA_PD13_ 1
#define _I2C4_SDA_PF15_ 1
#define _I2C4_SDA_PH12_ 1

#define I2C4_SMBA_PB5_ PB5,GPIO_AF6
#define I2C4_SMBA_PB9_ PB9,GPIO_AF11
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define I2C4_SMBA_PH10_ PH10,GPIO_AF4
#define _I2C4_SMBA_PB5_ 1
#define _I2C4_SMBA_PB9_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1
#define _I2C4_SMBA_PH10_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF5
#define I2S1_CK_PG11_ PG11,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3 (JTDO/TRACESWO)_ 1
#define _I2S1_CK_PG11_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PC4_ 1

#define I2S1_SDI_PA6_ PA6,GPIO_AF5
#define I2S1_SDI_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF5
#define I2S1_SDI_PG9_ PG9,GPIO_AF5
#define _I2S1_SDI_PA6_ 1
#define _I2S1_SDI_PB4 (NJTRST)_ 1
#define _I2S1_SDI_PG9_ 1

#define I2S1_SDO_PA7_ PA7,GPIO_AF5
#define I2S1_SDO_PB5_ PB5,GPIO_AF5
#define I2S1_SDO_PD7_ PD7,GPIO_AF5
#define _I2S1_SDO_PA7_ 1
#define _I2S1_SDO_PB5_ 1
#define _I2S1_SDO_PD7_ 1

#define I2S1_WS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PG10_ PG10,GPIO_AF5
#define _I2S1_WS_PA15 (JTDI)_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PG10_ 1

#define I2S2_CK_PA12_ PA12,GPIO_AF5
#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define I2S2_CK_PI1_ PI1,GPIO_AF5
#define _I2S2_CK_PA12_ 1
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD3_ 1
#define _I2S2_CK_PI1_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

#define I2S2_SDI_PB14_ PB14,GPIO_AF5
#define I2S2_SDI_PC2_ PC2,GPIO_AF5
#define I2S2_SDI_PC2_C_ PC2_C,GPIO_AF5
#define I2S2_SDI_PI2_ PI2,GPIO_AF5
#define _I2S2_SDI_PB14_ 1
#define _I2S2_SDI_PC2_ 1
#define _I2S2_SDI_PC2_C_ 1
#define _I2S2_SDI_PI2_ 1

#define I2S2_SDO_PB15_ PB15,GPIO_AF5
#define I2S2_SDO_PC1_ PC1,GPIO_AF5
#define I2S2_SDO_PC3_ PC3,GPIO_AF5
#define I2S2_SDO_PC3_C_ PC3_C,GPIO_AF5
#define I2S2_SDO_PI3_ PI3,GPIO_AF5
#define _I2S2_SDO_PB15_ 1
#define _I2S2_SDO_PC1_ 1
#define _I2S2_SDO_PC3_ 1
#define _I2S2_SDO_PC3_C_ 1
#define _I2S2_SDO_PI3_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PI0_ PI0,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB4 (NJTRST)_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PI0_ 1

#define I2S3_CK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3 (JTDO/TRACESWO)_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PC7_ 1

#define I2S3_SDI_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF6
#define I2S3_SDI_PC11_ PC11,GPIO_AF6
#define _I2S3_SDI_PB4 (NJTRST)_ 1
#define _I2S3_SDI_PC11_ 1

#define I2S3_SDO_PB2_ PB2,GPIO_AF7
#define I2S3_SDO_PB5_ PB5,GPIO_AF7
#define I2S3_SDO_PC12_ PC12,GPIO_AF6
#define I2S3_SDO_PD6_ PD6,GPIO_AF5
#define _I2S3_SDO_PB2_ 1
#define _I2S3_SDO_PB5_ 1
#define _I2S3_SDO_PC12_ 1
#define _I2S3_SDO_PD6_ 1

#define I2S3_WS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15 (JTDI)_ 1
#define _I2S3_WS_PA4_ 1

