susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H747.h
#define SAI2_SCK_A_PD13_ PD13,GPIO_AF10
#define SAI2_SCK_A_PI5_ PI5,GPIO_AF10
#define _SAI2_SCK_A_PD13_ 1
#define _SAI2_SCK_A_PI5_ 1

#define SAI2_SCK_B_PA2_ PA2,GPIO_AF8
#define SAI2_SCK_B_PE12_ PE12,GPIO_AF10
#define SAI2_SCK_B_PH2_ PH2,GPIO_AF10
#define _SAI2_SCK_B_PA2_ 1
#define _SAI2_SCK_B_PE12_ 1
#define _SAI2_SCK_B_PH2_ 1

#define SAI2_SD_A_PD11_ PD11,GPIO_AF10
#define SAI2_SD_A_PI6_ PI6,GPIO_AF10
#define _SAI2_SD_A_PD11_ 1
#define _SAI2_SD_A_PI6_ 1

#define SAI2_SD_B_PA0_ PA0,GPIO_AF10
#define SAI2_SD_B_PA0_C_ PA0_C,GPIO_AF10
#define SAI2_SD_B_PE11_ PE11,GPIO_AF10
#define SAI2_SD_B_PF11_ PF11,GPIO_AF10
#define SAI2_SD_B_PG10_ PG10,GPIO_AF10
#define _SAI2_SD_B_PA0_ 1
#define _SAI2_SD_B_PA0_C_ 1
#define _SAI2_SD_B_PE11_ 1
#define _SAI2_SD_B_PF11_ 1
#define _SAI2_SD_B_PG10_ 1

#define SAI3_FS_A_PD4_ PD4,GPIO_AF6
#define _SAI3_FS_A_PD4_ 1

#define SAI3_FS_B_PD10_ PD10,GPIO_AF6
#define _SAI3_FS_B_PD10_ 1

#define SAI3_MCLK_A_PD15_ PD15,GPIO_AF6
#define _SAI3_MCLK_A_PD15_ 1

#define SAI3_MCLK_B_PD14_ PD14,GPIO_AF6
#define _SAI3_MCLK_B_PD14_ 1

#define SAI3_SCK_A_PD0_ PD0,GPIO_AF6
#define _SAI3_SCK_A_PD0_ 1

#define SAI3_SCK_B_PD8_ PD8,GPIO_AF6
#define _SAI3_SCK_B_PD8_ 1

#define SAI3_SD_A_PD1_ PD1,GPIO_AF6
#define _SAI3_SD_A_PD1_ 1

#define SAI3_SD_B_PD9_ PD9,GPIO_AF6
#define _SAI3_SD_B_PD9_ 1

#define SAI4_CK1_PE2_ PE2,GPIO_AF10
#define _SAI4_CK1_PE2_ 1

#define SAI4_CK2_PE5_ PE5,GPIO_AF10
#define _SAI4_CK2_PE5_ 1

#define SAI4_D1_PB2_ PB2,GPIO_AF10
#define SAI4_D1_PC1_ PC1,GPIO_AF10
#define SAI4_D1_PD6_ PD6,GPIO_AF10
#define SAI4_D1_PE6_ PE6,GPIO_AF9
#define _SAI4_D1_PB2_ 1
#define _SAI4_D1_PC1_ 1
#define _SAI4_D1_PD6_ 1
#define _SAI4_D1_PE6_ 1

#define SAI4_D2_PE4_ PE4,GPIO_AF10
#define _SAI4_D2_PE4_ 1

#define SAI4_D3_PC5_ PC5,GPIO_AF10
#define SAI4_D3_PF10_ PF10,GPIO_AF10
#define _SAI4_D3_PC5_ 1
#define _SAI4_D3_PF10_ 1

#define SAI4_FS_A_PE4_ PE4,GPIO_AF8
#define _SAI4_FS_A_PE4_ 1

#define SAI4_FS_B_PF9_ PF9,GPIO_AF8
#define _SAI4_FS_B_PF9_ 1

#define SAI4_MCLK_A_PE2_ PE2,GPIO_AF8
#define _SAI4_MCLK_A_PE2_ 1

#define SAI4_MCLK_B_PF7_ PF7,GPIO_AF8
#define _SAI4_MCLK_B_PF7_ 1

#define SAI4_SCK_A_PE5_ PE5,GPIO_AF8
#define _SAI4_SCK_A_PE5_ 1

#define SAI4_SCK_B_PF8_ PF8,GPIO_AF8
#define _SAI4_SCK_B_PF8_ 1

#define SAI4_SD_A_PB2_ PB2,GPIO_AF8
#define SAI4_SD_A_PC1_ PC1,GPIO_AF8
#define SAI4_SD_A_PD6_ PD6,GPIO_AF8
#define SAI4_SD_A_PE6_ PE6,GPIO_AF8
#define _SAI4_SD_A_PB2_ 1
#define _SAI4_SD_A_PC1_ 1
#define _SAI4_SD_A_PD6_ 1
#define _SAI4_SD_A_PE6_ 1

#define SAI4_SD_B_PE3_ PE3,GPIO_AF8
#define SAI4_SD_B_PF6_ PF6,GPIO_AF8
#define _SAI4_SD_B_PE3_ 1
#define _SAI4_SD_B_PF6_ 1

#define SDMMC1_CDIR_PB9_ PB9,GPIO_AF7
#define _SDMMC1_CDIR_PB9_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

#define SDMMC1_CKIN_PB8_ PB8,GPIO_AF7
#define _SDMMC1_CKIN_PB8_ 1

#define SDMMC1_CMD_PD2_ PD2,GPIO_AF12
#define _SDMMC1_CMD_PD2_ 1

#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D0DIR_PC6_ PC6,GPIO_AF8
#define _SDMMC1_D0DIR_PC6_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D123DIR_PC7_ PC7,GPIO_AF8
#define _SDMMC1_D123DIR_PC7_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define _SDMMC1_D2_PC10_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB8_ PB8,GPIO_AF12
#define _SDMMC1_D4_PB8_ 1

#define SDMMC1_D5_PB9_ PB9,GPIO_AF12
#define _SDMMC1_D5_PB9_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF12
#define _SDMMC1_D6_PC6_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define _SDMMC1_D7_PC7_ 1

#define SDMMC2_CK_PC1_ PC1,GPIO_AF9
#define SDMMC2_CK_PD6_ PD6,GPIO_AF11
#define _SDMMC2_CK_PC1_ 1
#define _SDMMC2_CK_PD6_ 1

#define SDMMC2_CMD_PA0_ PA0,GPIO_AF9
#define SDMMC2_CMD_PA0_C_ PA0_C,GPIO_AF9
#define SDMMC2_CMD_PD7_ PD7,GPIO_AF11
#define _SDMMC2_CMD_PA0_ 1
#define _SDMMC2_CMD_PA0_C_ 1
#define _SDMMC2_CMD_PD7_ 1

#define SDMMC2_D0_PB14_ PB14,GPIO_AF9
#define _SDMMC2_D0_PB14_ 1

#define SDMMC2_D1_PB15_ PB15,GPIO_AF9
#define _SDMMC2_D1_PB15_ 1

#define SDMMC2_D2_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF9
#define SDMMC2_D2_PG11_ PG11,GPIO_AF10
#define _SDMMC2_D2_PB3 (JTDO/TRACESWO)_ 1
#define _SDMMC2_D2_PG11_ 1

#define SDMMC2_D3_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF9
#define _SDMMC2_D3_PB4 (NJTRST)_ 1

#define SDMMC2_D4_PB8_ PB8,GPIO_AF10
#define _SDMMC2_D4_PB8_ 1

#define SDMMC2_D5_PB9_ PB9,GPIO_AF10
#define _SDMMC2_D5_PB9_ 1

#define SDMMC2_D6_PC6_ PC6,GPIO_AF10
#define _SDMMC2_D6_PC6_ 1

#define SDMMC2_D7_PC7_ PC7,GPIO_AF10
#define _SDMMC2_D7_PC7_ 1

#define SPDIFRX1_IN0_PD7_ PD7,GPIO_AF9
#define SPDIFRX1_IN0_PG11_ PG11,GPIO_AF8
#define _SPDIFRX1_IN0_PD7_ 1
#define _SPDIFRX1_IN0_PG11_ 1

#define SPDIFRX1_IN1_PD8_ PD8,GPIO_AF9
#define SPDIFRX1_IN1_PG12_ PG12,GPIO_AF8
#define _SPDIFRX1_IN1_PD8_ 1
#define _SPDIFRX1_IN1_PG12_ 1

#define SPDIFRX1_IN2_PC4_ PC4,GPIO_AF9
#define SPDIFRX1_IN2_PG8_ PG8,GPIO_AF8
#define _SPDIFRX1_IN2_PC4_ 1
#define _SPDIFRX1_IN2_PG8_ 1

#define SPDIFRX1_IN3_PC5_ PC5,GPIO_AF9
#define SPDIFRX1_IN3_PG9_ PG9,GPIO_AF8
#define _SPDIFRX1_IN3_PC5_ 1
#define _SPDIFRX1_IN3_PG9_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF5
#define SPI1_MISO_PG9_ PG9,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4 (NJTRST)_ 1
#define _SPI1_MISO_PG9_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PD7_ PD7,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PD7_ 1

#define SPI1_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PG10_ PG10,GPIO_AF5
#define _SPI1_NSS_PA15 (JTDI)_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PG10_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF5
#define SPI1_SCK_PG11_ PG11,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI1_SCK_PG11_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PC2_C_ PC2_C,GPIO_AF5
#define SPI2_MISO_PI2_ PI2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PC2_C_ 1
#define _SPI2_MISO_PI2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC1_ PC1,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PC3_C_ PC3_C,GPIO_AF5
#define SPI2_MOSI_PI3_ PI3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC1_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PC3_C_ 1
#define _SPI2_MOSI_PI3_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PI0_ PI0,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB4 (NJTRST)_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PI0_ 1

