susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H747.h
#define SPI2_SCK_PA12_ PA12,GPIO_AF5
#define SPI2_SCK_PA9_ PA9,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF5
#define SPI2_SCK_PI1_ PI1,GPIO_AF5
#define _SPI2_SCK_PA12_ 1
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD3_ 1
#define _SPI2_SCK_PI1_ 1

#define SPI3_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4 (NJTRST)_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB2_ PB2,GPIO_AF7
#define SPI3_MOSI_PB5_ PB5,GPIO_AF7
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define _SPI3_MOSI_PB2_ 1
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1

#define SPI3_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15 (JTDI)_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI3_SCK_PC10_ 1

#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE5_ PE5,GPIO_AF5
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE5_ 1

#define SPI4_MOSI_PE14_ PE14,GPIO_AF5
#define SPI4_MOSI_PE6_ PE6,GPIO_AF5
#define _SPI4_MOSI_PE14_ 1
#define _SPI4_MOSI_PE6_ 1

#define SPI4_NSS_PE11_ PE11,GPIO_AF5
#define SPI4_NSS_PE4_ PE4,GPIO_AF5
#define _SPI4_NSS_PE11_ 1
#define _SPI4_NSS_PE4_ 1

#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PE2_ PE2,GPIO_AF5
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PE2_ 1

#define SPI5_MISO_PF8_ PF8,GPIO_AF5
#define SPI5_MISO_PH7_ PH7,GPIO_AF5
#define SPI5_MISO_PJ11_ PJ11,GPIO_AF5
#define _SPI5_MISO_PF8_ 1
#define _SPI5_MISO_PH7_ 1
#define _SPI5_MISO_PJ11_ 1

#define SPI5_MOSI_PF11_ PF11,GPIO_AF5
#define SPI5_MOSI_PF9_ PF9,GPIO_AF5
#define SPI5_MOSI_PJ10_ PJ10,GPIO_AF5
#define _SPI5_MOSI_PF11_ 1
#define _SPI5_MOSI_PF9_ 1
#define _SPI5_MOSI_PJ10_ 1

#define SPI5_NSS_PF6_ PF6,GPIO_AF5
#define SPI5_NSS_PH5_ PH5,GPIO_AF5
#define SPI5_NSS_PK1_ PK1,GPIO_AF5
#define _SPI5_NSS_PF6_ 1
#define _SPI5_NSS_PH5_ 1
#define _SPI5_NSS_PK1_ 1

#define SPI5_SCK_PF7_ PF7,GPIO_AF5
#define SPI5_SCK_PH6_ PH6,GPIO_AF5
#define SPI5_SCK_PK0_ PK0,GPIO_AF5
#define _SPI5_SCK_PF7_ 1
#define _SPI5_SCK_PH6_ 1
#define _SPI5_SCK_PK0_ 1

#define SPI6_MISO_PA6_ PA6,GPIO_AF8
#define SPI6_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define SPI6_MISO_PG12_ PG12,GPIO_AF5
#define _SPI6_MISO_PA6_ 1
#define _SPI6_MISO_PB4 (NJTRST)_ 1
#define _SPI6_MISO_PG12_ 1

#define SPI6_MOSI_PA7_ PA7,GPIO_AF8
#define SPI6_MOSI_PB5_ PB5,GPIO_AF8
#define SPI6_MOSI_PG14_ PG14,GPIO_AF5
#define _SPI6_MOSI_PA7_ 1
#define _SPI6_MOSI_PB5_ 1
#define _SPI6_MOSI_PG14_ 1

#define SPI6_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define SPI6_NSS_PA4_ PA4,GPIO_AF8
#define SPI6_NSS_PG8_ PG8,GPIO_AF5
#define _SPI6_NSS_PA15 (JTDI)_ 1
#define _SPI6_NSS_PA4_ 1
#define _SPI6_NSS_PG8_ 1

#define SPI6_SCK_PA5_ PA5,GPIO_AF8
#define SPI6_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF8
#define SPI6_SCK_PG13_ PG13,GPIO_AF5
#define _SPI6_SCK_PA5_ 1
#define _SPI6_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI6_SCK_PG13_ 1

#define SWPMI1_RX_PC8_ PC8,GPIO_AF11
#define _SWPMI1_RX_PC8_ 1

#define SWPMI1_SUSPEND_PC9_ PC9,GPIO_AF11
#define _SWPMI1_SUSPEND_PC9_ 1

#define SWPMI1_TX_PC7_ PC7,GPIO_AF11
#define _SWPMI1_TX_PC7_ 1

#define SYS_JTRST_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF0
#define _SYS_JTRST_PB4 (NJTRST)_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF2
#define TIM12_CH1_PH6_ PH6,GPIO_AF2
#define _TIM12_CH1_PB14_ 1
#define _TIM12_CH1_PH6_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF2
#define TIM12_CH2_PH9_ PH9,GPIO_AF2
#define _TIM12_CH2_PB15_ 1
#define _TIM12_CH2_PH9_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM15_BKIN_PA0_ PA0,GPIO_AF4
#define TIM15_BKIN_PA0_C_ PA0_C,GPIO_AF4
#define TIM15_BKIN_PE3_ PE3,GPIO_AF4
#define _TIM15_BKIN_PA0_ 1
#define _TIM15_BKIN_PA0_C_ 1
#define _TIM15_BKIN_PE3_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF4
#define TIM15_CH1_PE5_ PE5,GPIO_AF4
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PE5_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF4
#define TIM15_CH1N_PA1_C_ PA1_C,GPIO_AF4
#define TIM15_CH1N_PE4_ PE4,GPIO_AF4
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PA1_C_ 1
#define _TIM15_CH1N_PE4_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF4
#define TIM15_CH2_PE6_ PE6,GPIO_AF4
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PE6_ 1

#define TIM16_BKIN_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF1
#define TIM16_BKIN_PF10_ PF10,GPIO_AF1
#define _TIM16_BKIN_PB4 (NJTRST)_ 1
#define _TIM16_BKIN_PF10_ 1

#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define TIM16_CH1_PF6_ PF6,GPIO_AF1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PF6_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define TIM16_CH1N_PF8_ PF8,GPIO_AF1
#define _TIM16_CH1N_PB6_ 1
#define _TIM16_CH1N_PF8_ 1

#define TIM17_BKIN_PB5_ PB5,GPIO_AF1
#define TIM17_BKIN_PG6_ PG6,GPIO_AF1
#define _TIM17_BKIN_PB5_ 1
#define _TIM17_BKIN_PG6_ 1

#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define TIM17_CH1_PF7_ PF7,GPIO_AF1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PF7_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define TIM17_CH1N_PF9_ PF9,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1
#define _TIM17_CH1N_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF1
#define TIM1_BKIN_PK2_ PK2,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1
#define _TIM1_BKIN_PK2_ 1

#define TIM1_BKIN2_PE6_ PE6,GPIO_AF1
#define TIM1_BKIN2_PG4_ PG4,GPIO_AF1
#define _TIM1_BKIN2_PE6_ 1
#define _TIM1_BKIN2_PG4_ 1

#define TIM1_BKIN2_COMP1_PE6_ PE6,GPIO_AF11
#define TIM1_BKIN2_COMP1_PG4_ PG4,GPIO_AF11
#define _TIM1_BKIN2_COMP1_PE6_ 1
#define _TIM1_BKIN2_COMP1_PG4_ 1

#define TIM1_BKIN2_COMP2_PE6_ PE6,GPIO_AF11
#define TIM1_BKIN2_COMP2_PG4_ PG4,GPIO_AF11
#define _TIM1_BKIN2_COMP2_PE6_ 1
#define _TIM1_BKIN2_COMP2_PG4_ 1

#define TIM1_BKIN_COMP1_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_COMP1_PB12_ PB12,GPIO_AF13
#define TIM1_BKIN_COMP1_PE15_ PE15,GPIO_AF13
#define TIM1_BKIN_COMP1_PK2_ PK2,GPIO_AF11
#define _TIM1_BKIN_COMP1_PA6_ 1
#define _TIM1_BKIN_COMP1_PB12_ 1
#define _TIM1_BKIN_COMP1_PE15_ 1
#define _TIM1_BKIN_COMP1_PK2_ 1

